Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཡོངས་སུ་ཤེས་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་ལས་མི་འདའ་བའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གྲགས་པར་སྒྲོག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོས་རྒྱས་པར་འགེངས་བའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་འདུ་བ་དང་། འཇིག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གཞི་དང་དབྱིབས་དང་། རྒྱན་རྣམ་པར་དགོད་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པ་རྣམ་པར་སྤྲུལ་ཏེ།
en: teaching the wisdom that always knows the time for ripening and guiding all beings; teaching the wisdom that resounds throughout the entire realm of phenomena; teaching the wisdom that pervades everywhere, in each instant of mind, the ocean of all the ways of knowing the entire realm of phenomena; teaching the knowledge of the formation and destruction of the ocean of all world realms; teaching the knowledge of the basis, shape, and arrayed displays of all world realms;

source: སྤྱན་སྔར་ཕྱིན་ནས། མཆོད་ཅིང་རིམ་གྲོར་བྱེད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་སྤྲིན་ཡང་དག་པར་འཛིན་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: and teaching the knowledge of emanating offerings to all the tathāgatas, going into their presence, making offerings, rendering service, and possessing clouds of Dharma wheels.

source: དེ་ལྟར་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པས་སེམས་ཅན་རྣམས་ཀྱི་དགའ་བསྐྱེད་པ་དང་། སེམས་རབ་ཏུ་དང་བར་བྱེད་པ་དང་། རབ་ཏུ་དགའ་བ་སྐྱེད་པ་དང་། མོས་པ་འཕེལ་བར་བྱེད་པ་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་ཟློག་པ་དང་། སེམས་རྣམ་པར་སྤྱོད་པ་དང་། སེམས་སྐྱོན་མེད་པར་སྐྱེ་བར་བྱེད་པ་དང་། དབང་པོ་གསལ་བར་བྱེད་པ་དང་། མོས་པའི་སྟོབས་ཡོངས་སུ་སྐྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱེད་པ་མཐོང་ངོ་།
en: And by teaching in that way the practice of the perfection of knowledge, they were bringing happiness to beings, making their minds clear, creating joy, increasing aspiration, dispelling unhappiness, purifying the mind, creating a faultless mind, clarifying the senses, creating the power of aspiration, and causing irreversible progress toward omniscience. In the same way that he saw beings being ripened in worlds through the teaching of the practice of the perfections, he saw the night goddess Pramudita­nayana­jagad­virocanā proclaiming all the bodhisattva Dharmas: the initial accumulation of developed motivation; the methods for serving and venerating kalyāṇamitras; approaching the feet of tathāgatas and making offerings to them and attending them; every method for practicing good qualities;

source: །ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པས་འཇིག་རྟེན་དུ་ཅི་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་མཐོང་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་ཚུལ་གྱིས་མཚན་མོའི་ལྷ་མོར་རབ་ཏུ་དགའ་བའི་མིག་འཕྲོ་བར་རྣམ་པར་སྣང་བའི་ཐོག་མ་སེམས་བསྐྱེད་པའི་ཚོགས་དང་། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་ཐབས་དང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དུ་ཕྱིན་ཅིང་མཆོད་པ་དང་། རིམ་གྲོ་བྱས་པའི་ཚུལ་དང་། དགེ་བའི་ཆོས་སྤྱད་པའི་ཐབས་ཇི་སྙེད་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པས་གཏང་བར་དཀའ་བ་ཡོངས་སུ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྦྱང་བའི་ཐབས་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་དང་། འཁོར་མང་པོ་དང་། ལོངས་སྤྱོད་ཀྱི་དབང་ཆེན་པོ་ཡོངས་སུ་བཏང་སྟེ།
en: making the most difficult of gifts through the practice of the perfection of generosity; the methods for training in the perfection of correct conduct; all the methods for giving up the great power of kingship, retinues, and great power over enjoyments and becoming a renunciate; all the accomplishments of patience in the domain of vows of discipline and great asceticism that are difficult to undertake in this world; all resolute engagement in the bodhisattva vows of discipline;

source: མངོན་པར་འབྱུང་བའི་ཐབས་ཇི་སྙེད་པ་དང་། འཇིག་རྟེན་གྱི་དཀའ་བའི་སྤྱོད་པ་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་ཆེན་པོའི་དཀྱིལ་འཁོར་ལ་བཟོད་པ་མངོན་པར་བསྒྲུབས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྟུལ་ཞུགས་ཡང་དག་པར་བླང་བའི་སྦྱོར་བ་ལ་མི་གཡོ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་བརྟན་པའི་ཆོས་རྒྱ་མཚོ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཉེས་བྱས་དང་། ངན་དུ་སྨྲ་བ་དང་། ཉེས་པར་སྤྱོད་པ་ཐམས་ཅད་བག་ལ་ཞ་བར་བྱེད་པའི་སྦྱོར་བ་དང་། ལུས་དང་སེམས་ཀྱི་གནོད་པ་ཉམས་སུ་བཟོད་པར་བྱེད་པའི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཆོས་ཐམས་ཅད་འཇིག་པ་མེད་པའི་ཆོས་ཉིད་ལ་བཟོད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་ཡིད་ཆེས་པའི་བཟོད་པ་དང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པའི་བཟོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྩོམ་ཞིང་སྦྱོར་བའི་བརྩོན་འགྲུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་བརྩོན་འགྲུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱ་བ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བསྒྲུབ་པ་རྣམ་པར་དག་པའི་སྤྱོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པས།
en: the ocean of the qualities of firm bodhisattva commitments; the endurance of the bad actions, bad speech, and bad thoughts of all realms of beings; the endurance of harm to the body and the mind; the patience of the nonperishing nature of the Dharma; the patience of belief in all Dharmas; the patience of realizing the nature of the Dharma; the diligence for engaging in undertaking omniscience; the diligence for accomplishing all the qualities of buddhahood; the practice of the perfection of diligence; the accumulation of the perfection of meditation; dedication to the perfection of meditation; the pure practices that accomplish the perfection of meditation; the miraculous powers from the attainment of bodhisattva samādhis; the entry through an ocean of samādhi gateways; the practices of the perfection of meditation; the accumulation of the perfection of wisdom; the ways of purifying the sun disk of great bodhisattva wisdom;

source: རྣམ་པར་འཕྲུལ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཆེན་པོའི་ཉི་མའི་དཀྱིལ་འཁོར་རྣམ་པར་སྦྱང་བའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཆེན་པོའི་སྤྲིན་ཡོངས་སུ་འདུ་བའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཀྱི་གཏེར་ཆེན་པོའི་ཚོགས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་རྣམ་པར་དཔྱད་པའི་ཚུལ་དང་། སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཐབས་ཆེན་པོ་ལ་མཁས་པའི་ཚུལ་གྱི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཐབས་ཆེན་པོ་ལ་མཁས་པ་ཡོངས་སུ་དག་བར་བྱ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་གྲུབ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི།
en: the ways of accumulating the clouds of great wisdom; the accumulations of the great treasure of wisdom; the ways of analyzing the great ocean of wisdom; dedication to purification and skill in great methods; the bodies from the perfection of great bodhisattva prayers; the accomplishment of the perfection of great prayers; the practice of the perfection of great prayers; the dedication in the past to the perfection of great prayers;

source: སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པར་བྱ་བའི་ཚོགས་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྐྱེན་དུ་གྱུར་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་བསྟན་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྱམ་ཀླས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྣམ་པར་དམིགས་པར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྱམ་ཀླས་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྒྱས་པར་འགེངས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱ་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལྷུན་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འགྲུབ་པར་བྱ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པའི་རྣམ་པར་རབ་ཏུ་ཕྱེ་བ་ལ་འཇུག་པ་འབྱུང་བ་ཡོངས་སུ་བསྒྲུབ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བའི་ཚུལ་དང་ལྡན་པའི་ཆོས་རྣམས་དང་། ཆོས་ཡོངས་སུ་བསྡུ་བ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ལས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཞིང་གི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བསྐལ་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། དུས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། སངས་རྒྱས་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཡོངས་སུ་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་འཁོར་ལོའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམ་པར་འབྱེད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྒྱ་མཚོའི་ཚུལ་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གང་ཆེན་མཚོའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་རྒྱུད་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་གཏེར་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ལུགས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་དང་དབུས་མེད་པའི་དམིགས་པ་ཅན་དེ་དག་ཐམས་ཅད་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་མངོན་པར་འཐོན་ཏེ།
en: the great accumulations for attaining the perfection of strength; the conditions for the perfection of strength; the great ocean of the ways of the perfection of strength; the teaching of the perfection of strength; the dedication in the past to the perfection of strength; the practice of the perfection of knowledge; the ways of the perfection of knowledge; the ways of the purification of the perfection of knowledge; the direction of the perfection of knowledge; following the perfection of knowledge; the vastness of the perfection of knowledge; absorption in the ways of the perfection of knowledge; focusing on the ways of the perfection of knowledge; following the vastness of the perfection of knowledge; the pervasion of the perfection of knowledge; the extent of the perfection of knowledge; the assemblage of the perfection of knowledge; dedication in the past to the accomplishment of the perfection of knowledge; the arrangement of the arising of entry into the classification of the kinds of practice of the perfection of knowledge; possessing the ways of absorption in the perfection of knowledge; seeking the knowledge of Dharma that encompasses what is Dharma and what is not Dharma; seeking the knowledge of karma; seeking the knowledge of realms; seeking the knowledge of kalpas; seeking the knowledge of times; seeking the knowledge of the occurrence of buddhas; seeking the knowledge of buddhas; seeking the knowledge of the bodhisattvas; seeking the knowledge of the arising of bodhisattva motivation; seeking the knowledge of the presence of bodhisattvas; seeking the knowledge of the arising of bodhisattvas; seeking the knowledge of the setting-forth of bodhisattvas; seeking the knowledge of prayers; seeking the knowledge of the Dharma wheels of bodhisattvas; seeking the knowledge of the analysis of the Dharma by bodhisattvas; seeking the knowledge of the ways of the sea of Dharma of the bodhisattvas; seeking the knowledge of the ocean of Dharma of the bodhisattvas; seeking the knowledge of the turning of the Dharma wheel of the bodhisattvas; seeking the knowledge of the treasure of the Dharma of the bodhisattvas; and seeking the knowledge of the state of the Dharma of the bodhisattvas.

source: སེམས་ཅན་གྱི་ལུས་ཀྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་ཅན་དུ་མངོན་པར་མཆོད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: Clouds of bodies of beings of various colors emitted from each of the night goddess Pramudita­nayana­jagad­virocanā’s pores ripened beings through all the limitless and centerless bodhisattva practices endowed with the perfection of knowledge.

source: འོག་མིན་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། མ་དྲོས་པ་དང་། མི་ཆེ་བའི་གཙང་མའི་གནས་ཀྱི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: he saw clouds of bodies that were like those of the Śuddhāvāsa devas of the Akaniṣṭha, Sudarśana , Sudṛśa, Atapa, and Avṛha paradises issuing forth and ripening beings.

source: །དེ་བཞིན་དུ་འབྲས་བུ་ཆེ་བ་དང་། བསོད་ནམས་འཕེལ་བ་དང་། སྤྲིན་དང་བྲལ་བའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: In the same way, he saw clouds of bodies that were like those of the devas in the Bṛhatphala, Puṇya­prasava, and Anabhraka paradises issuing forth and ripening beings.

source: །དགེ་རྒྱས་དང་ཚད་མེད་དགེ་བ་དང་། དགེ་བ་ཆུང་བའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the devas in the Śubhakṛtsna, Apramāṇa­śubha, and Parītta­śubha paradises issuing forth and ripening beings.

source: །ཀུན་སྣང་དང་བ་དང་། ཚད་མེད་སྣང་བ་དང་། སྣང་བ་ཆུང་ངུའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་།
en: He saw clouds of bodies that were like those of the devas in the Ābhāsvara, Apramāṇābha, and Parīttābha paradises issuing forth and ripening beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །ཚངས་ཆེན་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་རིས་ཀྱི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the devas in the Mahābrahma, Brahmapurohita, and Brahmapārṣada paradises issuing forth and ripening beings.

source: །དབང་སྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the deva king Vaśavartin and his devas and apsarases issuing forth and ripening beings.

source: །ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ལྷ་མོའི་ཚོགས་དང་། ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the deva king Sunirmita and his devas and apsarases issuing forth and ripening beings.

source: །རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the deva king Saṃtuṣita and his devas and apsarases issuing forth and ripening beings.

source: །རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོ་ལྷ་མོའི་ཚོགས་དང་ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the deva king Suyāma and his devas and apsarases issuing forth and ripening beings.

source: །ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ལྷ་མོའི་ཚོགས་དང་། ལྷའི་བུ་དང་བཅས་པ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the deva king Śakra and his devas and apsarases issuing forth and ripening beings.

source: །དྲི་ཟའི་རྒྱལ་པོ་གནས་སྲུང་པོ་དང་། དྲི་ཟའི་བུ་དང་། དྲི་ཟའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the gandharva king Dhṛtarāṣṭra and his male gandharvas and female gandharvas issuing forth and ripening beings.

source: །གྲུལ་བུམ་གྱི་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ་དང་། གྲུལ་བུམ་གྱི་བུ་དང་གྲུལ་བུམ་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the kumbhāṇḍa king Virūḍhaka and his male kumbhāṇḍas and female kumbhāṇḍas issuing forth and ripening beings.

source: །ཀླུའི་རྒྱལ་པོ་མིག་མི་བཟང་དང་། ཀླུའི་བུ་དང་། ཀླུའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the nāga king Virūpākṣa and his male nāgas and female nāgas issuing forth and ripening beings.

source: །གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཆེན་པོ་ངལ་བསོ་པོ་དང་། གནོད་སྦྱིན་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the great yakṣa king Vaiśravaṇa and his male yakṣas and female yakṣas issuing forth and ripening beings.

source: །མིའམ་ཅིའི་རྒྱལ་པོསྡོང་པོ་དང་། མི་འམ་ཅིའི་བུ་དང་། མིའམ་ཅིའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the kinnara king Druma and his male kinnaras and female kinnaras issuing forth and ripening beings.

source: །ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་བློ་གྲོས་བཟང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་དང་། ལྟོ་འཕྱི་ཆེན་པོའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the mahoraga lord Sumati and his male mahoragas and female mahoragas issuing forth and ripening beings.

source: །ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཤུགས་དྲག་སྟོབས་ཆེན་དང་། ནམ་མཁའ་ལྡིང་གི་བུ་དང་ནམ་མཁའ་ལྡིང་གི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the garuḍa lord Mahā­bala­vega­sthāma and his male garuḍas and female garuḍas issuing forth and ripening beings.

source: །ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ལྷ་མ་ཡིན་གྱི་བུ་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the asura lord Rāhu and his male asuras and female asuras issuing forth and ripening beings.

source: །ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེ་དང་། གཤིན་རྗེའི་བུ་དང་། གཤིན་རྗེའི་བུ་མོ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the Dharma king Yama and his male yamas and female yamas issuing forth and ripening beings.

source: །མིའི་དབང་པོ་དང་སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་།
en: He saw clouds of bodies that were like those of the lord of humans and his male humans and female humans issuing forth and ripening beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །དེ་བཞིན་དུ་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་ཐོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: Thus he saw clouds of bodies that were like those of all the beings that appear in all existences issuing forth and ripening beings.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་དྲང་སྲོང་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of śrāvakas, pratyeka­buddhas, and ṛṣis issuing forth and ripening beings.

source: །རླུང་དང་ཆུ་དང་མེའི་ཕུང་པོ་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like the devas of the realms of wind, water, and fire issuing forth and ripening beings.

source: །རྒྱ་མཚོ་དང་། ཆུ་ཀླུང་དང་། རི་དང་། ནགས་ཚལ་དང་། ལོ་ཏོག་དང་། སྨན་དང་། ཤིང་དང་། སའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw clouds of bodies that were like those of the devas of oceans, rivers, mountains, forests, harvests, herbs, trees, and earth issuing forth and ripening beings.

source: །བཟའ་ཤིང་གི་ར་བ་དང་། གྲོང་ཁྱེར་དང་། སྙིང་པོ་བྱང་ཆུབ་དང་། ཉིན་པར་དང་། མཚན་མོ་དང་། ནམ་མཁའ་དང་། ཕྱོགས་དང་། རྐང་གིས་འགྲོ་བ་དང་། ལུས་ཀྱི་རིས་སུ་གཏོགས་པ་དང་། ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་བ་ནས།
en: He saw clouds of bodies that were like those of the devas of parks, cities, the bodhimaṇḍa, the day, the night, space, directions, those who walk on legs, and all those who have bodies issuing forth and ripening beings.

source: དེ་བཞིན་དུ་ལག་ན་རྡོ་རྗེ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། ཕྱོགས་བཅུར་རྒྱས་པར་བཀང་སྟེ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་བར་དུ་མཐོང་སྟེ།
en: In the same way, he saw clouds of bodies that were like Vajrapāṇi issuing forth, spreading throughout the ten directions, being present before beings throughout the extent of the ways of the realm of phenomena, and ripening beings.

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་སེམས་ཐོག་མ་བསྐྱེད་པའི་ཚོགས་ལ་སྩོགས་པའི་སྔོན་གྱི།
en: He saw, beginning with the night goddess Pramudita­nayana­jagad­virocanā’s first accumulation of the development of the aspiration to enlightenment, the unbroken succession of the accomplishment of a virtuous mind in her past lifetimes;

source: ཚེ་རབས་ལ་ཡོངས་སུ་བསྒྲུབས་པའི་དགེ་བའི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ།
en: the constant succession of praising the aspiration to enlightenment; the constant succession of passing away and obtaining a rebirth; the constant succession of the possession of a body; the constant succession of the wheel of names; the constant succession of going to a kalyāṇamitra;
